worg/index.org
#+TITLE: 欢迎来到Org-Mode社区：Worg！
#+AUTHOR: Worg people
#+TRANSLATOR Crew: amoblin <amoblin@gmail.com>
#+EMAIL: mdl AT imapmail DOT org
#+STARTUP: align fold nodlcheck hidestars oddeven intestate
#+SEQ_TODO: TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS: Write(w) Update(u) Fix(f) Check(c)
#+LANGUAGE: en
#+PRIORITIES: A C B
#+CATEGORY: worg
#+OPTIONS: H:3 num:nil toc:t \n:nil ::t |:t ^:t -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc

Worg的 [[http://orgmode.org/worg/sitemap.html][站点地图]] 和 [[http://orgmode.org/worg/theindex.html][索引]]

* Org-Mode和Worg介绍

Org-mode是用简洁的纯文本文件来管理复杂生活的强大系统。它把所有的
笔记、脑图、待办事项、日历、日程安排以及项目进度无缝整合到了一个
唯一的系统里，在这个系统里可以很容易的搜索(比如通过grep)、加密
(比如用GnuPG)、备份和同步(比如用Dropbox)、导入导出，并且随时随地
可访问(比如用iPhone或Android智能机来访问)。它甚至可以用来写作网页
和文档。

查看一些 Org-mode截图 。看看 人们如何谈论Org-mode的，阅读一些用户
和Org-mode的那些事。

Org-mode作为广受欢迎的Emacs文本编辑器的一部分来发布。Emacs能运行的地方，
就是Org-mode能使用的地方，包括GNU-Linux、Windows以及Mac。Org-mode由
Carsten Dominik编写，目前由Bastien Guerry维护，被很多有帮助的人使用，
比如你，？

  Written by
Carsten Dominik, it is currently maintained by Bastien Guerry and used by
many helpful people who, like you, are desperate to get and stay organized.

你现在正在阅读的页面是 =Worg= 的一部分，是 [[file:..][Org-mode网站]] 的一部分，
由Org-mode粉丝组成的志愿者社区谱写。 它包含向导、想法、代码片段等等，
通过这些分享希望能够让Org-mode的介绍和定制尽可能的容易一些。Worg由
Worg贡献者小组的Matthew Lundin维护，下一个可能就是你噢。

* Org-Mode资源
:PROPERTIES:
:ID:       A6F83C16-B1B9-405A-B996-8D2CA1274DEB
:END:

** 学习Org-Mode

#+INDEX: Tutorials
#+INDEX: Glossary

- [[http://orgmode.org/][Org-mode 主页]]              : Org-mode官方主页
- [[file:org-tutorials/index.org][Org-mode 向导]]              : 学习Org-mode的完美起点
- [[file:org-glossary.org][Org-mode 术语表]]               : org-mode技术详解
- [[http://orgmode.org/manual/index.html][Org-mode 手册]]            : 广而全的文档
- [[file:../guide/index.html][Org-mode 指南]]                 : Not extensive, but complete documentation
  - org ([[file:orgguide/orgguide.es.texi][texi]] - [[http://www.davidam.com/docu/orgguide.es.html][html]])
- [[file:org-configs/index.org][Org-mode configuration]]           : Beginner's customization guide, examples, survey,
  and a list of all hooks
- [[file:orgcard.org][Org-mode reference card]]          : check the [[file:orgcard.org][HTML]], [[http://orgmode.org/orgcard.pdf][pdf]] and [[http://orgmode.org/orgcard.txt][ASCII]] versions.
  - French translation of the orgcard ([[file:code/latex/fr-orgcard.tex][tex]] - [[file:images/bzg/fr-orgcard.pdf][pdf]])
- [[file:exporters/index.org][New exporter]]            : Preliminary documentation for the new exporter.
** 通过Org-Mode获取帮助

- [[file:org-faq.org][Org-mode FAQ]]      : 发邮件列表之前看看这里
- [[file:org-mailing-list.org][Org-mode邮件列表]]  : 疑难问题、建议和讨论
- Org-mode IRC频道  : 若要实时问答, 可以上[[http://freenode.net/][ Freenode]] 的 =#org-mode=
** 有效使用Org-Mode

- Use Org-mode as a [[file:org-gtd-etc.org][task management system]] (perfect for GTD and the
  Pomodoro Technique)
- Author [[file:org-blog-wiki.org][Blogs and Wikis with Org-mode]] (see [[file:org-web.org][example web wages]])
- Integrate [[file:org-mac.org][Org-mode with Mac OS X]]
- Synchronize org-mode files easily with [[https://github.com/simonthum/git-sync][git-sync]], a [[file:org-tutorials/org-vcs.org][VCS of your choice]], or [[file:org-tutorials/unison-sync.org][Unison]]
** Dive Deeper into Org-Mode

- [[file:dev/index.org][Org-mode for developers]] : reference documentation for developers
- [[file:org-blog-articles.org][Blog posts]]              : Read a variety of articles from introductions to
  specific customizations
- [[file:org-hacks.org][Org-mode Hacks]]          : Copy code snippets from other users
- [[file:org-contrib/babel/index.html][Org Babel]] : Learn about [[http://en.wikipedia.org/wiki/Literate_programming][Literate programming]] within Org-mode
- Tools
  - [[file:org-translators.org][Org-mode conversion tools]]  : Import into and export out of Org-mode
  - [[file:org-tools/index.org][Org-mode parsing libraries]] : Parse and analyze .org files
- [[file:org-dependencies.org][Org-mode dependencies]] : Dependencies on external packages for advanced
  functionality [Work in progress]
- [[file:org-papers.org][Org-papers]] : Whitepapers and books about Org-mode
** Check Out Third-Party Contributions

- [[file:org-contrib/index.org][Contributed packages]], including extensive documentation
- Repository of contributed code:
  1. the =contrib/= directory of the Org-mode package
  2. the [[http://orgmode.org/worg/code/][code]] directory of Worg
     - [[http://orgmode.org/worg/code/org-info-js][org-info-js]] by Sebastian Rose: great javascript
       tool to navigate through a HTML page (as exported by Org) the way you
       navigate through an Org or an info manual, i.e. supporting folding,
       previous/next buttons, etc.
- [[file:org-devel.org][Additions under development]]
* 加入社区

- Check out the list of [[file:worgers.org][Worgers and their User Pages]] and a few
    [[file:org-people.org][profiles of the Org-mode Community]] (with photos ☺)
- Meet other users in the flesh at [[file:orgcamps.org][OrgCamps]]

** Help out

- Improve Worg by sharing your knowledge about Org-mode: see [[Maintenance of Worg]].
- Improve Org-mode:
  - Send [[http://orgmode.org/org.html#Feedback][bug reports]] after checking the [[file:org-issues.org][issue tracker]]
  - Help [[file:org-tests/index.org][test]]
  - [[file:org-contribute.org][Contribute to Org-mode]]
* Worg的维护

- Intro
  - [[file:worg-about.org][About the Worg project]]
  - [[file:worg-setup.org][How Worg is set up on the server]]
  - [[file:worg-maintainance.org][About Worg maintainer and gardners]]
- Tasks
  - [[file:worg-todo.org][The Worg TODO file]]
- Howtos
  - [[file:worg-git.org][An introduction to git for Worgers]]
  - [[file:worg-editing.org][Conventions and tools for editing Worg]]
  - [[file:worg-git-ssh-key.org][How to create your own SSH key?]]
- Miscellaneous
  - [[http://orgmode.org/w/worg.git][Recent changes to Worg]] (git log at /orgmode.org/)
  - [[http://orgmode.org/worg/sources/][Org-mode source documents of all Worg pages]]

** Latest changes to the Worg git repository

Note: You can also subscribe to changes via [[http://orgmode.org/w/?p%3Dworg.git%3Ba%3Drss%3Bopt%3D--no-merges][RSS]] or [[http://orgmode.org/w/?p%3Dworg.git%3Ba%3Datom%3Bopt%3D--no-merges][ATOM]] (courtesy of repo.or.cz).
* Git'r done!

If you like losing your time by reading stuff on how to get organized,
go and check the [[file:gitrdone.org][Git'r done!]] page.
