worg/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>欢迎来到Org-Mode社区：Worg！</title>
<!-- 2014-10-31 五 22:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Worg people" />
</head>
<body>
<div id="content">
<h1 class="title">欢迎来到Org-Mode社区：Worg！</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Org-Mode和Worg介绍</a></li>
<li><a href="#sec-2">Org-Mode资源</a>
<ul>
<li><a href="#sec-2-1">学习Org-Mode</a></li>
<li><a href="#sec-2-2">通过Org-Mode获取帮助</a></li>
<li><a href="#sec-2-3">有效使用Org-Mode</a></li>
<li><a href="#sec-2-4">Dive Deeper into Org-Mode</a></li>
<li><a href="#sec-2-5">Check Out Third-Party Contributions</a></li>
</ul>
</li>
<li><a href="#sec-3">加入社区</a>
<ul>
<li><a href="#sec-3-1">Help out</a></li>
</ul>
</li>
<li><a href="#sec-4">Worg的维护</a>
<ul>
<li><a href="#sec-4-1">Latest changes to the Worg git repository</a></li>
</ul>
</li>
<li><a href="#sec-5">Git'r done!</a></li>
</ul>
</div>
</div>
<p>
#+TRANSLATOR Crew: amoblin &lt;amoblin@gmail.com&gt;
</p>
<p>
Worg的 <a href="http://orgmode.org/worg/sitemap.html">站点地图</a> 和 <a href="http://orgmode.org/worg/theindex.html">索引</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Org-Mode和Worg介绍</h2>
<div class="outline-text-2" id="text-1">
<p>
Org-mode是用简洁的纯文本文件来管理复杂生活的强大系统。它把所有的
笔记、脑图、待办事项、日历、日程安排以及项目进度无缝整合到了一个
唯一的系统里，在这个系统里可以很容易的搜索(比如通过grep)、加密
(比如用GnuPG)、备份和同步(比如用Dropbox)、导入导出，并且随时随地
可访问(比如用iPhone或Android智能机来访问)。它甚至可以用来写作网页
和文档。
</p>

<p>
查看一些 Org-mode截图 。看看 人们如何谈论Org-mode的，阅读一些用户
和Org-mode的那些事。
</p>

<p>
Org-mode作为广受欢迎的Emacs文本编辑器的一部分来发布。Emacs能运行的地方，
就是Org-mode能使用的地方，包括GNU-Linux、Windows以及Mac。Org-mode由
Carsten Dominik编写，目前由Bastien Guerry维护，被很多有帮助的人使用，
比如你，？
</p>

<p>
  Written by
Carsten Dominik, it is currently maintained by Bastien Guerry and used by
many helpful people who, like you, are desperate to get and stay organized.
</p>

<p>
你现在正在阅读的页面是 <code>Worg</code> 的一部分，是 <a href="..">Org-mode网站</a> 的一部分，
由Org-mode粉丝组成的志愿者社区谱写。 它包含向导、想法、代码片段等等，
通过这些分享希望能够让Org-mode的介绍和定制尽可能的容易一些。Worg由
Worg贡献者小组的Matthew Lundin维护，下一个可能就是你噢。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><a id="ID-A6F83C16-B1B9-405A-B996-8D2CA1274DEB" name="ID-A6F83C16-B1B9-405A-B996-8D2CA1274DEB"></a>Org-Mode资源</h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">学习Org-Mode</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="http://orgmode.org/">Org-mode 主页</a>              : Org-mode官方主页
</li>
<li><a href="org-tutorials/index.html">Org-mode 向导</a>              : 学习Org-mode的完美起点
</li>
<li><a href="org-glossary.html">Org-mode 术语表</a>               : org-mode技术详解
</li>
<li><a href="http://orgmode.org/manual/index.html">Org-mode 手册</a>            : 广而全的文档
</li>
<li><a href="../guide/index.html">Org-mode 指南</a>                 : Not extensive, but complete documentation
<ul class="org-ul">
<li>org (<a href="orgguide/orgguide.es.texi">texi</a> - <a href="http://www.davidam.com/docu/orgguide.es.html">html</a>)
</li>
</ul>
</li>
<li><a href="org-configs/index.html">Org-mode configuration</a>           : Beginner's customization guide, examples, survey,
and a list of all hooks
</li>
<li><a href="orgcard.html">Org-mode reference card</a>          : check the <a href="orgcard.html">HTML</a>, <a href="http://orgmode.org/orgcard.pdf">pdf</a> and <a href="http://orgmode.org/orgcard.txt">ASCII</a> versions.
<ul class="org-ul">
<li>French translation of the orgcard (<a href="code/latex/fr-orgcard.tex">tex</a> - <a href="images/bzg/fr-orgcard.pdf">pdf</a>)
</li>
</ul>
</li>
<li><a href="exporters/index.html">New exporter</a>            : Preliminary documentation for the new exporter.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">通过Org-Mode获取帮助</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="org-faq.html">Org-mode FAQ</a>      : 发邮件列表之前看看这里
</li>
<li><a href="org-mailing-list.html">Org-mode邮件列表</a>  : 疑难问题、建议和讨论
</li>
<li>Org-mode IRC频道  : 若要实时问答, 可以上<a href="http://freenode.net/"> Freenode</a> 的 <code>#org-mode</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">有效使用Org-Mode</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Use Org-mode as a <a href="org-gtd-etc.html">task management system</a> (perfect for GTD and the
Pomodoro Technique)
</li>
<li>Author <a href="org-blog-wiki.html">Blogs and Wikis with Org-mode</a> (see <a href="org-web.html">example web wages</a>)
</li>
<li>Integrate <a href="org-mac.html">Org-mode with Mac OS X</a>
</li>
<li>Synchronize org-mode files easily with <a href="https://github.com/simonthum/git-sync">git-sync</a>, a <a href="org-tutorials/org-vcs.html">VCS of your choice</a>, or <a href="org-tutorials/unison-sync.html">Unison</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Dive Deeper into Org-Mode</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><a href="dev/index.html">Org-mode for developers</a> : reference documentation for developers
</li>
<li><a href="org-blog-articles.html">Blog posts</a>              : Read a variety of articles from introductions to
specific customizations
</li>
<li><a href="org-hacks.html">Org-mode Hacks</a>          : Copy code snippets from other users
</li>
<li><a href="org-contrib/babel/index.html">Org Babel</a> : Learn about <a href="http://en.wikipedia.org/wiki/Literate_programming">Literate programming</a> within Org-mode
</li>
<li>Tools
<ul class="org-ul">
<li><a href="org-translators.html">Org-mode conversion tools</a>  : Import into and export out of Org-mode
</li>
<li><a href="org-tools/index.html">Org-mode parsing libraries</a> : Parse and analyze .org files
</li>
</ul>
</li>
<li><a href="org-dependencies.html">Org-mode dependencies</a> : Dependencies on external packages for advanced
functionality [Work in progress]
</li>
<li><a href="org-papers.html">Org-papers</a> : Whitepapers and books about Org-mode
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Check Out Third-Party Contributions</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li><a href="org-contrib/index.html">Contributed packages</a>, including extensive documentation
</li>
<li>Repository of contributed code:
<ol class="org-ol">
<li>the <code>contrib/</code> directory of the Org-mode package
</li>
<li>the <a href="http://orgmode.org/worg/code/">code</a> directory of Worg
<ul class="org-ul">
<li><a href="http://orgmode.org/worg/code/org-info-js">org-info-js</a> by Sebastian Rose: great javascript
tool to navigate through a HTML page (as exported by Org) the way you
navigate through an Org or an info manual, i.e. supporting folding,
previous/next buttons, etc.
</li>
</ul>
</li>
</ol>
</li>
<li><a href="org-devel.html">Additions under development</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">加入社区</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Check out the list of <a href="worgers.html">Worgers and their User Pages</a> and a few
<a href="org-people.html">profiles of the Org-mode Community</a> (with photos ☺)
</li>
<li>Meet other users in the flesh at <a href="orgcamps.html">OrgCamps</a>
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Help out</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Improve Worg by sharing your knowledge about Org-mode: see <i>Maintenance of Worg</i>.
</li>
<li>Improve Org-mode:
<ul class="org-ul">
<li>Send <a href="http://orgmode.org/org.html#Feedback">bug reports</a> after checking the <a href="org-issues.html">issue tracker</a>
</li>
<li>Help <a href="org-tests/index.html">test</a>
</li>
<li><a href="org-contribute.html">Contribute to Org-mode</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Worg的维护</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Intro
<ul class="org-ul">
<li><a href="worg-about.html">About the Worg project</a>
</li>
<li><a href="worg-setup.html">How Worg is set up on the server</a>
</li>
<li><a href="worg-maintainance.html">About Worg maintainer and gardners</a>
</li>
</ul>
</li>
<li>Tasks
<ul class="org-ul">
<li><a href="worg-todo.html">The Worg TODO file</a>
</li>
</ul>
</li>
<li>Howtos
<ul class="org-ul">
<li><a href="worg-git.html">An introduction to git for Worgers</a>
</li>
<li><a href="worg-editing.html">Conventions and tools for editing Worg</a>
</li>
<li><a href="worg-git-ssh-key.html">How to create your own SSH key?</a>
</li>
</ul>
</li>
<li>Miscellaneous
<ul class="org-ul">
<li><a href="http://orgmode.org/w/worg.git">Recent changes to Worg</a> (git log at <i>orgmode.org</i>)
</li>
<li><a href="http://orgmode.org/worg/sources/">Org-mode source documents of all Worg pages</a>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Latest changes to the Worg git repository</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Note: You can also subscribe to changes via <a href="http://orgmode.org/w/?p=worg.git;a=rss;opt=--no-merges">RSS</a> or <a href="http://orgmode.org/w/?p=worg.git;a=atom;opt=--no-merges">ATOM</a> (courtesy of repo.or.cz).
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Git'r done!</h2>
<div class="outline-text-2" id="text-5">
<p>
If you like losing your time by reading stuff on how to get organized,
go and check the <a href="gitrdone.html">Git'r done!</a> page.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Worg people</p>
<p class="date">Created: 2014-10-31 五 22:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
